## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/fb894687-6a6c-425c-8279-b9bcc3f600e1/terraform-bin show -no-color main.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.aks.azurerm_kubernetes_cluster.aks has been deleted
  - resource "azurerm_kubernetes_cluster" "aks" {
      - id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks" -> null
      - kube_config                         = (sensitive value) -> null
      - kube_config_raw                     = (sensitive value) -> null
        name                                = "prod-velidaaks"
        tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
            "type"        = "POC"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce has been deleted
  - resource "azurerm_monitor_data_collection_endpoint" "dce" {
      - id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionEndpoints/MSProm-australiaeast-prod-velidaaks" -> null
        name                          = "MSProm-australiaeast-prod-velidaaks"
        tags                          = {}
        # (8 unchanged attributes hidden)
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr has been deleted
  - resource "azurerm_monitor_data_collection_rule" "dcr" {
      - id                          = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-prod-velidaaks" -> null
        name                        = "MSProm-australiaeast-prod-velidaaks"
        tags                        = {}
        # (6 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace has been deleted
  - resource "azurerm_monitor_workspace" "workspace" {
      - id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks" -> null
      - name                                = "prod-amw-velidaaks" -> null
        tags                                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
            "type"        = "POC"
        }
        # (6 unchanged attributes hidden)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/552c4deb-bd93-7b88-bff7-e9d864447544" -> null
        name                                   = "552c4deb-bd93-7b88-bff7-e9d864447544"
        # (9 unchanged attributes hidden)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana has been deleted
  - resource "azurerm_dashboard_grafana" "grafana" {
      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks" -> null
        name                                   = "prod-grafana-velidaaks"
        tags                                   = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
            "type"        = "POC"
        }
        # (12 unchanged attributes hidden)

      - identity {
          - principal_id = "44e13744-6dc6-4e8a-909b-1ee2a5883e32" -> null
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role has been deleted
  - resource "azurerm_role_assignment" "role" {
      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/fd0fc2a8-96d9-ad3d-5096-4ae23dfaa5a0" -> null
        name                                   = "fd0fc2a8-96d9-ad3d-5096-4ae23dfaa5a0"
        # (9 unchanged attributes hidden)
    }

  # module.ssh-key.azapi_resource.ssh_public_key has been deleted
  - resource "azapi_resource" "ssh_public_key" {
      - id                        = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise" -> null
        name                      = "sshinporpoise"
        # (9 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi has been deleted
  - resource "azurerm_user_assigned_identity" "msi" {
      - id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks" -> null
        name                = "prod-uai-velidaaks"
      - principal_id        = "ff04adbe-1400-41e3-907a-5c45904104e7" -> null
        tags                = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
            "type"        = "POC"
        }
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.acr.azurerm_container_registry.acr will be updated in-place
  ~ resource "azurerm_container_registry" "acr" {
      ~ admin_enabled                 = true -> false
        id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks"
        name                          = "prodacrvelidaaks"
        tags                          = {
            "application" = "velidaaks"
            "environment" = "prod"
            "location"    = "australiaeast"
            "owner"       = "willvelida"
            "sub"         = "MVP-sub"
            "type"        = "POC"
        }
        # (17 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.acr_pull_role.azurerm_role_assignment.role must be replaced
-/+ resource "azurerm_role_assignment" "role" {
      ~ id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/6f5e1c47-db94-a687-18e1-8ded834d36c5" -> (known after apply)
      ~ name                                   = "6f5e1c47-db94-a687-18e1-8ded834d36c5" -> (known after apply)
      ~ principal_id                           = "ff04adbe-1400-41e3-907a-5c45904104e7" -> (known after apply) # forces replacement
      ~ role_definition_id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aks.azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + azure_policy_enabled                = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "prod-velidaaks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "prod-velidaaks"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "rg-velidaaks"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "prod"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
          + "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
      + workload_identity_enabled           = true

      + api_server_access_profile (known after apply)

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + enable_auto_scaling  = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 5
          + max_pods             = (known after apply)
          + min_count            = 1
          + name                 = "default"
          + node_count           = 3
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_D2s_v3"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity (known after apply)

      + linux_profile {
          + admin_username = "willvelida"

          + ssh_key {
              + key_data = (known after apply)
            }
        }

      + monitor_metrics {}

      + network_profile {
          + dns_service_ip          = (known after apply)
          + docker_bridge_cidr      = (known after apply)
          + ebpf_data_plane         = (known after apply)
          + ip_versions             = (known after apply)
          + load_balancer_sku       = "standard"
          + network_data_plane      = (known after apply)
          + network_mode            = (known after apply)
          + network_plugin          = "kubenet"
          + network_policy          = (known after apply)
          + outbound_ip_address_ids = (known after apply)
          + outbound_ip_prefix_ids  = (known after apply)
          + outbound_type           = "loadBalancer"
          + pod_cidr                = (known after apply)
          + pod_cidrs               = (known after apply)
          + service_cidr            = (known after apply)
          + service_cidrs           = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)

      + workload_autoscaler_profile {
          + keda_enabled                              = true
          + vertical_pod_autoscaler_controlled_values = (known after apply)
          + vertical_pod_autoscaler_enabled           = false
          + vertical_pod_autoscaler_update_mode       = (known after apply)
        }
    }

  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce will be created
  + resource "azurerm_monitor_data_collection_endpoint" "dce" {
      + configuration_access_endpoint = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = "Linux"
      + location                      = "australiaeast"
      + logs_ingestion_endpoint       = (known after apply)
      + name                          = "MSProm-australiaeast-prod-velidaaks"
      + public_network_access_enabled = true
      + resource_group_name           = "rg-velidaaks"
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be created
  + resource "azurerm_monitor_data_collection_rule" "dcr" {
      + data_collection_endpoint_id = (known after apply)
      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"
      + id                          = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = "Linux"
      + location                    = "australiaeast"
      + name                        = "MSProm-australiaeast-prod-velidaaks"
      + resource_group_name         = "rg-velidaaks"

      + data_flow {
          + destinations = [
              + "prod-amw-velidaaks",
            ]
          + streams      = [
              + "Microsoft-PrometheusMetrics",
            ]
        }

      + data_sources {
          + prometheus_forwarder {
              + name    = "PrometheusDataSource"
              + streams = [
                  + "Microsoft-PrometheusMetrics",
                ]
            }
        }

      + destinations {
          + monitor_account {
              + monitor_account_id = (known after apply)
              + name               = "prod-amw-velidaaks"
            }
        }
    }

  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created
  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {
      + data_collection_rule_id = (known after apply)
      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"
      + id                      = (known after apply)
      + name                    = "dcra-dcr-prometheus-aks"
      + target_resource_id      = (known after apply)
    }

  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created
  + resource "azurerm_monitor_workspace" "workspace" {
      + default_data_collection_endpoint_id = (known after apply)
      + default_data_collection_rule_id     = (known after apply)
      + id                                  = (known after apply)
      + location                            = "australiaeast"
      + name                                = "prod-amw-velidaaks"
      + public_network_access_enabled       = true
      + query_endpoint                      = (known after apply)
      + resource_group_name                 = "rg-velidaaks"
      + tags                                = {
          + "application" = "velidaaks"
          + "environment" = "prod"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
          + "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
    }

  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created
  + resource "azurerm_kubernetes_cluster_extension" "ext" {
      + aks_assigned_identity = (known after apply)
      + cluster_id            = (known after apply)
      + current_version       = (known after apply)
      + extension_type        = "Microsoft.Dapr"
      + id                    = (known after apply)
      + name                  = "dapr"
      + release_namespace     = (known after apply)
      + release_train         = "Stable"
      + target_namespace      = (known after apply)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5667d54a-8d63-4fab-87b9-1df5e5804189"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created
  + resource "azurerm_dashboard_grafana" "grafana" {
      + api_key_enabled                        = false
      + auto_generated_domain_name_label_scope = "TenantReuse"
      + deterministic_outbound_ip_enabled      = false
      + endpoint                               = (known after apply)
      + grafana_major_version                  = "10"
      + grafana_version                        = (known after apply)
      + id                                     = (known after apply)
      + location                               = "australiaeast"
      + name                                   = "prod-grafana-velidaaks"
      + outbound_ip                            = (known after apply)
      + public_network_access_enabled          = true
      + resource_group_name                    = "rg-velidaaks"
      + sku                                    = "Standard"
      + tags                                   = {
          + "application" = "velidaaks"
          + "environment" = "prod"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
          + "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
      + zone_redundancy_enabled                = false

      + azure_monitor_workspace_integrations {
          + resource_id = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Data Reader"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.network_contributor_role.azurerm_role_assignment.role must be replaced
-/+ resource "azurerm_role_assignment" "role" {
      ~ id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/d5c0ab69-4d83-1549-9384-44f8fa8590c8" -> (known after apply)
      ~ name                                   = "d5c0ab69-4d83-1549-9384-44f8fa8590c8" -> (known after apply)
      ~ principal_id                           = "ff04adbe-1400-41e3-907a-5c45904104e7" -> (known after apply) # forces replacement
      ~ role_definition_id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {
      + cluster_name        = "prod-velidaaks"
      + description         = "Kubernetes Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "KubernetesRecordingRulesRuleGroup-prod-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_rss"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_cache"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))
            EOT
          + record     = "node_namespace_pod_container:container_memory_swap"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))
            EOT
          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )
            EOT
          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))
            EOT
          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "deployment"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "daemonset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "statefulset"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))
            EOT
          + labels     = {
              + "workload_type" = "job"
            }
          + record     = "namespace_workload_pod:kube_pod_owner:relabel"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)
            EOT
          + record     = ":node_memory_MemAvailable_bytes:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)
            EOT
          + record     = "cluster:node_cpu:ratio_rate5m"
        }
    }

  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created
  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {
      + cluster_name        = "prod-velidaaks"
      + description         = "Node Recording Rules Rule Group"
      + id                  = (known after apply)
      + interval            = "PT1M"
      + location            = "australiaeast"
      + name                = "NodeRecordingRulesRuleGroup-prod-velidaaks"
      + resource_group_name = "rg-velidaaks"
      + rule_group_enabled  = true
      + scopes              = (known after apply)

      + rule {
          + enabled    = true
          + expression = <<-EOT
                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})
            EOT
          + record     = "instance:node_num_cpu:sum"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))
            EOT
          + record     = "instance:node_cpu_utilisation:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})
            EOT
          + record     = "instance:node_load1_per_cpu:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})
            EOT
          + record     = "instance:node_memory_utilisation:ratio"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_vmstat_pgmajfault{job="node"}[5m])
            EOT
          + record     = "instance:node_vmstat_pgmajfault:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])
            EOT
          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"
        }
      + rule {
          + enabled    = true
          + expression = <<-EOT
                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))
            EOT
          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"
        }
    }

  # module.ssh-key.azapi_resource.ssh_public_key will be created
  + resource "azapi_resource" "ssh_public_key" {
      + body                      = jsonencode({})
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "australiaeast"
      + name                      = "sshinporpoise"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"
    }

  # module.ssh-key.azapi_resource_action.ssh_public_key_gen must be replaced
-/+ resource "azapi_resource_action" "ssh_public_key_gen" {
      ~ id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise/generateKeyPair" -> (known after apply)
      ~ output                 = {
          - privateKey = <<-EOT
                -----BEGIN RSA PRIVATE KEY-----
                MIIG5AIBAAKCAYEA6mHNM6N37QSWcrHD6EhINtP4lZkLTKG3UTVTLxDvwetEcLyY
                M/4sRMn/u0nXDndNdjFDwB80M+xzt876GtyKvBjMbzcjTFaeiUpKGNwXssmc8GnA
                xGi6yh49VY5CYYPa/3lXZlDw1wPzs+IMa4r9aQu875jxiXjAfN5qRidfBRsG+6Q+
                ZVle6Q6PqMWPsNu21RIXmVgiTTzb2vAfPQMnK2QBztbJ0nTuLnpWQ7R1o5jyZPa9
                rOLzbigS+lHtVB2Tsa9lcIROBq2zh+e+Ffjn2BJj9Iraoj0bdYkV/cz+joyRaTW8
                HhZSKDz+0RrRXMWcJE//TbjaVDEI679mE5qSOWPhO7zSESnf7PoYb07/LH5ei9t8
                TYg5//5Ps89NsFKYlBX9B287WahNYn72iGl5OlRAs7mx8Dfxy1XcJMhqiMqN07eG
                n4iis0aFX/gYw85S4+L1wnnxnQm6ZNe3qp7xmH2ePQ9QsA4E7n0c40vXfVkqpB68
                zYyYa+djFrwZMvhxAgMBAAECggGBANNzWoJsxsPxMJ3W3ExR8bxtLcYg5X3EI7NC
                7YH3wKXtT7h5nMLDW0LQDkP0UO1/GkY4GcxZGmqBtsAsHZ1gPFWH9d+cGd9EAhEQ
                EZst7L9ifpCyh7NqXKH9+A2YozCAmXGEEiJ/gVgp+5HcrKHVKdu8OD7cd4QziUze
                B3i1Cld706fwvE4I+8Q8W8TCP2kqP18ozFuOlJuj/SEfIr+TeaH+vlbRlhClZ0BN
                JEg+pSbr1DrcE7DGqyFFTCHDCd6qMpvDqdWXn3U4deGtSQwc4ZqxMmhjwGWGOVuw
                sxtWjTUJg0GRaHORCu/VKTCS9IBz9ARLEHeTknuZfi0/WGfJT1K+fhPYgrVR3zbY
                6yHbr1EK+B7HImbssyKP5UFRihCad/RIOwvB5mMl6CCzwGREeggXRBVktk9iiuHt
                uuur8w+G10zJeF/2gHzJw2ERc5/E2AK16xVQ7nfGCz4UPa6Mn8tvXS11fvZCSrQb
                No6ugyf52AHZC5zwEGnUYw+d7fbPBQKBwQD4b989+Yhon5iJyFjSf/ni89vBPeqR
                lNACurbYTgjmXF1zRN9ZYJVV7N9U7oTwmBQ1KWaMOQZRXKVL+UI/5KSxuSx7IpbJ
                +toZCQp1FC+IwxtJphEz1Y83b5JVdcX1CPpg3RKVh2mHIRGin3k/QVqLQGZT4Qy8
                tzJk/7vvhow5NtLxsGpVucLG+D4gctrEWOUJJWRiNCvgix03S6X4i5psxG4hA2qI
                B/Y1IY7C1SdFtyojvFHATjnGo8Xpi72qIdMCgcEA8YRlWbLq78xFLoZdLHs9EKG5
                jsRfRU0F2N4//S68CaP5+tkWWcQLoQJOu6tIaVF2SOllWGJl8BlXo+yL/1Alg5+i
                sPXtBZWlRjwrEOsxnIIVIl7XQ1rFj+o1Lp+FGTQCgoa9Bnl7geWzMpm6IwdrerG4
                sbyh+rjxbtifYsOgE5D7OJ7h827qXqEFL0NFK+KGIjVp38tGPNhiRBg+ULFF7eJl
                esRNx0XhCvdcSok86qy+icaMH3Xl4zu0MZr3y04rAoHAR0Bummuyv67mJL4dG2Iw
                3PJrmGSVneM8NUwvnKHk04yyEJk0JYIZ0mb5NnaiEg7L3ONe0eCY+0TC86MtaP2+
                bmpZY4dsD8muO3foU+PSLjsm3FyQmnkpdhC9u1znxXsptBYzekc38NV/JVDviUDJ
                Ix75Oh1Vddpkzaq6z9ua493hagfat3NrdX1E9DF8pMuKBLGAtNmZq/C6FF3R4BLJ
                22AK5dUA/Lqr1lklhKN1e/0oTM958tl8oIff/zdg0iaZAoHAVqhVoUC0UYRu0km9
                xscVWxFcPiCxunDvhyf/t718FM10VZBtF5pjPctRKr9DhR6InZK5HWR5BRRiwNuQ
                Q/Si8T5nJq2m9RkDq1bNcQ2iyHBYWvPCs1Uvi/rSSD9Oh4OE3wavblJKgYpEqQRF
                qGnyI5z/Ey8Gw6p2Xnp1ff+JQVwE+ATyN+F1UKzf6lxtxlhKHp4htf3+3rgZUiuM
                uHFTEQ7psIodCkJFhCTLRadGZ0HCQDcwcd1gtg7nEeFzxcvvAoHBAPJJOZdUdsSX
                OSJJfb7IvHIbrKyB9B999F/vYC+38xOl3U7a/o7CI9yslDbFifz0R/Fgspdcc9rj
                /t4bJeb+NS4hyioJ9uKhXBc7/QduDbDguXSPzFInRAbgDG4NjxDrUuzMNJ/75J6E
                CFFSJSjHi36HnhhjXVuw5rU7gKYDW6mhqJSSyVfsNgUESG1mz1w7jdn5Ie+bdXGL
                6lRzcwbwDGhvICYCrsDFyPAJ+Tr4W17lIh6x3TDTZvhAbTlsbIVizA==
                -----END RSA PRIVATE KEY-----
            EOT
          - publicKey  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDqYc0zo3ftBJZyscPoSEg20/iVmQtMobdRNVMvEO/B60RwvJgz/ixEyf+7SdcOd012MUPAHzQz7HO3zvoa3Iq8GMxvNyNMVp6JSkoY3BeyyZzwacDEaLrKHj1VjkJhg9r/eVdmUPDXA/Oz4gxriv1pC7zvmPGJeMB83mpGJ18FGwb7pD5lWV7pDo+oxY+w27bVEheZWCJNPNva8B89AycrZAHO1snSdO4uelZDtHWjmPJk9r2s4vNuKBL6Ue1UHZOxr2VwhE4GrbOH574V+OfYEmP0itqiPRt1iRX9zP6OjJFpNbweFlIoPP7RGtFcxZwkT/9NuNpUMQjrv2YTmpI5Y+E7vNIRKd/s+hhvTv8sfl6L23xNiDn//k+zz02wUpiUFf0HbztZqE1ifvaIaXk6VECzubHwN/HLVdwkyGqIyo3Tt4afiKKzRoVf+BjDzlLj4vXCefGdCbpk17eqnvGYfZ49D1CwDgTufRzjS9d9WSqkHrzNjJhr52MWvBky+HE= generated-by-azure"
        } -> (known after apply)
      ~ resource_id            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "prod-uai-velidaaks"
      + principal_id        = (known after apply)
      + resource_group_name = "rg-velidaaks"
      + tags                = {
          + "application" = "velidaaks"
          + "environment" = "prod"
          + "location"    = "australiaeast"
          + "owner"       = "willvelida"
          + "sub"         = "MVP-sub"
          + "type"        = "POC"
        }
      + tenant_id           = (known after apply)
    }

Plan: 16 to add, 1 to change, 3 to destroy.

Changes to Outputs:
  ~ kube_config         = (sensitive value)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks has been deleted%0A  - resource "azurerm_kubernetes_cluster" "aks" {%0A      - id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerService/managedClusters/prod-velidaaks" -> null%0A      - kube_config                         = (sensitive value) -> null%0A      - kube_config_raw                     = (sensitive value) -> null%0A        name                                = "prod-velidaaks"%0A        tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A            "type"        = "POC"%0A        }%0A        # (38 unchanged attributes hidden)%0A%0A        # (8 unchanged blocks hidden)%0A    }%0A%0A  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce has been deleted%0A  - resource "azurerm_monitor_data_collection_endpoint" "dce" {%0A      - id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionEndpoints/MSProm-australiaeast-prod-velidaaks" -> null%0A        name                          = "MSProm-australiaeast-prod-velidaaks"%0A        tags                          = {}%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr has been deleted%0A  - resource "azurerm_monitor_data_collection_rule" "dcr" {%0A      - id                          = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Insights/dataCollectionRules/MSProm-australiaeast-prod-velidaaks" -> null%0A        name                        = "MSProm-australiaeast-prod-velidaaks"%0A        tags                        = {}%0A        # (6 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace has been deleted%0A  - resource "azurerm_monitor_workspace" "workspace" {%0A      - id                                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks" -> null%0A      - name                                = "prod-amw-velidaaks" -> null%0A        tags                                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A            "type"        = "POC"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role has been deleted%0A  - resource "azurerm_role_assignment" "role" {%0A      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks/providers/Microsoft.Authorization/roleAssignments/552c4deb-bd93-7b88-bff7-e9d864447544" -> null%0A        name                                   = "552c4deb-bd93-7b88-bff7-e9d864447544"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana has been deleted%0A  - resource "azurerm_dashboard_grafana" "grafana" {%0A      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Dashboard/grafana/prod-grafana-velidaaks" -> null%0A        name                                   = "prod-grafana-velidaaks"%0A        tags                                   = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A            "type"        = "POC"%0A        }%0A        # (12 unchanged attributes hidden)%0A%0A      - identity {%0A          - principal_id = "44e13744-6dc6-4e8a-909b-1ee2a5883e32" -> null%0A            # (3 unchanged attributes hidden)%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role has been deleted%0A  - resource "azurerm_role_assignment" "role" {%0A      - id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Monitor/accounts/prod-amw-velidaaks/providers/Microsoft.Authorization/roleAssignments/fd0fc2a8-96d9-ad3d-5096-4ae23dfaa5a0" -> null%0A        name                                   = "fd0fc2a8-96d9-ad3d-5096-4ae23dfaa5a0"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.ssh-key.azapi_resource.ssh_public_key has been deleted%0A  - resource "azapi_resource" "ssh_public_key" {%0A      - id                        = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise" -> null%0A        name                      = "sshinporpoise"%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi has been deleted%0A  - resource "azurerm_user_assigned_identity" "msi" {%0A      - id                  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks" -> null%0A        name                = "prod-uai-velidaaks"%0A      - principal_id        = "ff04adbe-1400-41e3-907a-5c45904104e7" -> null%0A        tags                = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A            "type"        = "POC"%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.acr.azurerm_container_registry.acr will be updated in-place%0A  ~ resource "azurerm_container_registry" "acr" {%0A      ~ admin_enabled                 = true -> false%0A        id                            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks"%0A        name                          = "prodacrvelidaaks"%0A        tags                          = {%0A            "application" = "velidaaks"%0A            "environment" = "prod"%0A            "location"    = "australiaeast"%0A            "owner"       = "willvelida"%0A            "sub"         = "MVP-sub"%0A            "type"        = "POC"%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A      ~ identity {%0A          ~ identity_ids = [%0A              - "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ManagedIdentity/userAssignedIdentities/prod-uai-velidaaks",%0A            ] -> (known after apply)%0A            # (3 unchanged attributes hidden)%0A        }%0A    }%0A%0A  # module.acr_pull_role.azurerm_role_assignment.role must be replaced%0A-/+ resource "azurerm_role_assignment" "role" {%0A      ~ id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.ContainerRegistry/registries/prodacrvelidaaks/providers/Microsoft.Authorization/roleAssignments/6f5e1c47-db94-a687-18e1-8ded834d36c5" -> (known after apply)%0A      ~ name                                   = "6f5e1c47-db94-a687-18e1-8ded834d36c5" -> (known after apply)%0A      ~ principal_id                           = "ff04adbe-1400-41e3-907a-5c45904104e7" -> (known after apply) # forces replacement%0A      ~ role_definition_id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> (known after apply)%0A      + skip_service_principal_aad_check       = (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be created%0A  + resource "azurerm_kubernetes_cluster" "aks" {%0A      + api_server_authorized_ip_ranges     = (known after apply)%0A      + azure_policy_enabled                = true%0A      + current_kubernetes_version          = (known after apply)%0A      + dns_prefix                          = "prod-velidaaks"%0A      + fqdn                                = (known after apply)%0A      + http_application_routing_zone_name  = (known after apply)%0A      + id                                  = (known after apply)%0A      + image_cleaner_enabled               = false%0A      + image_cleaner_interval_hours        = 48%0A      + kube_admin_config                   = (sensitive value)%0A      + kube_admin_config_raw               = (sensitive value)%0A      + kube_config                         = (sensitive value)%0A      + kube_config_raw                     = (sensitive value)%0A      + kubernetes_version                  = (known after apply)%0A      + location                            = "australiaeast"%0A      + name                                = "prod-velidaaks"%0A      + node_resource_group                 = (known after apply)%0A      + node_resource_group_id              = (known after apply)%0A      + oidc_issuer_enabled                 = true%0A      + oidc_issuer_url                     = (known after apply)%0A      + portal_fqdn                         = (known after apply)%0A      + private_cluster_enabled             = false%0A      + private_cluster_public_fqdn_enabled = false%0A      + private_dns_zone_id                 = (known after apply)%0A      + private_fqdn                        = (known after apply)%0A      + public_network_access_enabled       = true%0A      + resource_group_name                 = "rg-velidaaks"%0A      + role_based_access_control_enabled   = true%0A      + run_command_enabled                 = true%0A      + sku_tier                            = "Free"%0A      + support_plan                        = "KubernetesOfficial"%0A      + tags                                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "prod"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A          + "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A      + workload_identity_enabled           = true%0A%0A      + api_server_access_profile (known after apply)%0A%0A      + auto_scaler_profile (known after apply)%0A%0A      + default_node_pool {%0A          + enable_auto_scaling  = true%0A          + kubelet_disk_type    = (known after apply)%0A          + max_count            = 5%0A          + max_pods             = (known after apply)%0A          + min_count            = 1%0A          + name                 = "default"%0A          + node_count           = 3%0A          + node_labels          = (known after apply)%0A          + orchestrator_version = (known after apply)%0A          + os_disk_size_gb      = (known after apply)%0A          + os_disk_type         = "Managed"%0A          + os_sku               = (known after apply)%0A          + scale_down_mode      = "Delete"%0A          + type                 = "VirtualMachineScaleSets"%0A          + ultra_ssd_enabled    = false%0A          + vm_size              = "Standard_D2s_v3"%0A          + workload_runtime     = (known after apply)%0A        }%0A%0A      + identity {%0A          + identity_ids = (known after apply)%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + kubelet_identity (known after apply)%0A%0A      + linux_profile {%0A          + admin_username = "willvelida"%0A%0A          + ssh_key {%0A              + key_data = (known after apply)%0A            }%0A        }%0A%0A      + monitor_metrics {}%0A%0A      + network_profile {%0A          + dns_service_ip          = (known after apply)%0A          + docker_bridge_cidr      = (known after apply)%0A          + ebpf_data_plane         = (known after apply)%0A          + ip_versions             = (known after apply)%0A          + load_balancer_sku       = "standard"%0A          + network_data_plane      = (known after apply)%0A          + network_mode            = (known after apply)%0A          + network_plugin          = "kubenet"%0A          + network_policy          = (known after apply)%0A          + outbound_ip_address_ids = (known after apply)%0A          + outbound_ip_prefix_ids  = (known after apply)%0A          + outbound_type           = "loadBalancer"%0A          + pod_cidr                = (known after apply)%0A          + pod_cidrs               = (known after apply)%0A          + service_cidr            = (known after apply)%0A          + service_cidrs           = (known after apply)%0A%0A          + load_balancer_profile (known after apply)%0A%0A          + nat_gateway_profile (known after apply)%0A        }%0A%0A      + windows_profile (known after apply)%0A%0A      + workload_autoscaler_profile {%0A          + keda_enabled                              = true%0A          + vertical_pod_autoscaler_controlled_values = (known after apply)%0A          + vertical_pod_autoscaler_enabled           = false%0A          + vertical_pod_autoscaler_update_mode       = (known after apply)%0A        }%0A    }%0A%0A  # module.am-dce.azurerm_monitor_data_collection_endpoint.dce will be created%0A  + resource "azurerm_monitor_data_collection_endpoint" "dce" {%0A      + configuration_access_endpoint = (known after apply)%0A      + id                            = (known after apply)%0A      + immutable_id                  = (known after apply)%0A      + kind                          = "Linux"%0A      + location                      = "australiaeast"%0A      + logs_ingestion_endpoint       = (known after apply)%0A      + name                          = "MSProm-australiaeast-prod-velidaaks"%0A      + public_network_access_enabled = true%0A      + resource_group_name           = "rg-velidaaks"%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule.dcr will be created%0A  + resource "azurerm_monitor_data_collection_rule" "dcr" {%0A      + data_collection_endpoint_id = (known after apply)%0A      + description                 = "DCR for Azure Monitor Metrics Profile (Managed Prometheus)"%0A      + id                          = (known after apply)%0A      + immutable_id                = (known after apply)%0A      + kind                        = "Linux"%0A      + location                    = "australiaeast"%0A      + name                        = "MSProm-australiaeast-prod-velidaaks"%0A      + resource_group_name         = "rg-velidaaks"%0A%0A      + data_flow {%0A          + destinations = [%0A              + "prod-amw-velidaaks",%0A            ]%0A          + streams      = [%0A              + "Microsoft-PrometheusMetrics",%0A            ]%0A        }%0A%0A      + data_sources {%0A          + prometheus_forwarder {%0A              + name    = "PrometheusDataSource"%0A              + streams = [%0A                  + "Microsoft-PrometheusMetrics",%0A                ]%0A            }%0A        }%0A%0A      + destinations {%0A          + monitor_account {%0A              + monitor_account_id = (known after apply)%0A              + name               = "prod-amw-velidaaks"%0A            }%0A        }%0A    }%0A%0A  # module.am-dcr.azurerm_monitor_data_collection_rule_association.dcra will be created%0A  + resource "azurerm_monitor_data_collection_rule_association" "dcra" {%0A      + data_collection_rule_id = (known after apply)%0A      + description             = "Association of DCR. Deleting this association will break the data collection for this AKS Cluster"%0A      + id                      = (known after apply)%0A      + name                    = "dcra-dcr-prometheus-aks"%0A      + target_resource_id      = (known after apply)%0A    }%0A%0A  # module.azure-monitor-workspace.azurerm_monitor_workspace.workspace will be created%0A  + resource "azurerm_monitor_workspace" "workspace" {%0A      + default_data_collection_endpoint_id = (known after apply)%0A      + default_data_collection_rule_id     = (known after apply)%0A      + id                                  = (known after apply)%0A      + location                            = "australiaeast"%0A      + name                                = "prod-amw-velidaaks"%0A      + public_network_access_enabled       = true%0A      + query_endpoint                      = (known after apply)%0A      + resource_group_name                 = "rg-velidaaks"%0A      + tags                                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "prod"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A          + "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A    }%0A%0A  # module.dapr-extension.azurerm_kubernetes_cluster_extension.ext will be created%0A  + resource "azurerm_kubernetes_cluster_extension" "ext" {%0A      + aks_assigned_identity = (known after apply)%0A      + cluster_id            = (known after apply)%0A      + current_version       = (known after apply)%0A      + extension_type        = "Microsoft.Dapr"%0A      + id                    = (known after apply)%0A      + name                  = "dapr"%0A      + release_namespace     = (known after apply)%0A      + release_train         = "Stable"%0A      + target_namespace      = (known after apply)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = "5667d54a-8d63-4fab-87b9-1df5e5804189"%0A      + principal_type                   = "User"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Grafana Admin"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.managed-grafana.azurerm_dashboard_grafana.grafana will be created%0A  + resource "azurerm_dashboard_grafana" "grafana" {%0A      + api_key_enabled                        = false%0A      + auto_generated_domain_name_label_scope = "TenantReuse"%0A      + deterministic_outbound_ip_enabled      = false%0A      + endpoint                               = (known after apply)%0A      + grafana_major_version                  = "10"%0A      + grafana_version                        = (known after apply)%0A      + id                                     = (known after apply)%0A      + location                               = "australiaeast"%0A      + name                                   = "prod-grafana-velidaaks"%0A      + outbound_ip                            = (known after apply)%0A      + public_network_access_enabled          = true%0A      + resource_group_name                    = "rg-velidaaks"%0A      + sku                                    = "Standard"%0A      + tags                                   = {%0A          + "application" = "velidaaks"%0A          + "environment" = "prod"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A          + "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A      + zone_redundancy_enabled                = false%0A%0A      + azure_monitor_workspace_integrations {%0A          + resource_id = (known after apply)%0A        }%0A%0A      + identity {%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "SystemAssigned"%0A        }%0A    }%0A%0A  # module.monitoring_data_reader_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_id                     = (known after apply)%0A      + principal_type                   = "ServicePrincipal"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Monitoring Data Reader"%0A      + scope                            = (known after apply)%0A      + skip_service_principal_aad_check = (known after apply)%0A    }%0A%0A  # module.network_contributor_role.azurerm_role_assignment.role must be replaced%0A-/+ resource "azurerm_role_assignment" "role" {%0A      ~ id                                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Authorization/roleAssignments/d5c0ab69-4d83-1549-9384-44f8fa8590c8" -> (known after apply)%0A      ~ name                                   = "d5c0ab69-4d83-1549-9384-44f8fa8590c8" -> (known after apply)%0A      ~ principal_id                           = "ff04adbe-1400-41e3-907a-5c45904104e7" -> (known after apply) # forces replacement%0A      ~ role_definition_id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/providers/Microsoft.Authorization/roleDefinitions/4d97b98b-1d4f-4787-a291-c67834d212e7" -> (known after apply)%0A      + skip_service_principal_aad_check       = (known after apply)%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.kubernetes_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "kubernetes_recording_rules_rule_group" {%0A      + cluster_name        = "prod-velidaaks"%0A      + description         = "Kubernetes Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "KubernetesRecordingRulesRuleGroup-prod-velidaaks"%0A      + resource_group_name = "rg-velidaaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (cluster, namespace, pod, container) (  irate(container_cpu_usage_seconds_total{job="cadvisor", image!=""}[5m])) * on (cluster, namespace, pod) group_left(node) topk by (cluster, namespace, pod) (  1, max by(cluster, namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_cpu_usage_seconds_total:sum_irate"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_working_set_bytes{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_working_set_bytes"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_rss{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_rss"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_cache{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_cache"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                container_memory_swap{job="cadvisor", image!=""}* on (namespace, pod) group_left(node) topk by(namespace, pod) (1,  max by(namespace, pod, node) (kube_pod_info{node!=""}))%0A            EOT%0A          + record     = "node_namespace_pod_container:container_memory_swap"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_requests"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_requests{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_requests:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) (  (kube_pod_status_phase{phase=~"Pending|Running"} == 1))%0A            EOT%0A          + record     = "cluster:namespace:pod_memory:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="memory",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_memory:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}  * on (namespace, pod, cluster)group_left() max by (namespace, pod, cluster) ( (kube_pod_status_phase{phase=~"Pending|Running"} == 1) )%0A            EOT%0A          + record     = "cluster:namespace:pod_cpu:active:kube_pod_container_resource_limits"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum by (namespace, cluster) (    sum by (namespace, pod, cluster) (        max by (namespace, pod, container, cluster) (          kube_pod_container_resource_limits{resource="cpu",job="kube-state-metrics"}        ) * on(namespace, pod, cluster) group_left() max by (namespace, pod, cluster) (          kube_pod_status_phase{phase=~"Pending|Running"} == 1        )    ))%0A            EOT%0A          + record     = "namespace_cpu:kube_pod_container_resource_limits:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    label_replace(      kube_pod_owner{job="kube-state-metrics", owner_kind="ReplicaSet"},      "replicaset", "$1", "owner_name", "(.*)"    ) * on(replicaset, namespace) group_left(owner_name) topk by(replicaset, namespace) (      1, max by (replicaset, namespace, owner_name) (        kube_replicaset_owner{job="kube-state-metrics"}      )    ),    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "deployment"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="DaemonSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "daemonset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="StatefulSet"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "statefulset"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                max by (cluster, namespace, workload, pod) (  label_replace(    kube_pod_owner{job="kube-state-metrics", owner_kind="Job"},    "workload", "$1", "owner_name", "(.*)"  ))%0A            EOT%0A          + labels     = {%0A              + "workload_type" = "job"%0A            }%0A          + record     = "namespace_workload_pod:kube_pod_owner:relabel"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(  node_memory_MemAvailable_bytes{job="node"} or  (    node_memory_Buffers_bytes{job="node"} +    node_memory_Cached_bytes{job="node"} +    node_memory_MemFree_bytes{job="node"} +    node_memory_Slab_bytes{job="node"}  )) by (cluster)%0A            EOT%0A          + record     = ":node_memory_MemAvailable_bytes:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum(rate(node_cpu_seconds_total{job="node",mode!="idle",mode!="iowait",mode!="steal"}[5m])) by (cluster) /count(sum(node_cpu_seconds_total{job="node"}) by (cluster, instance, cpu)) by (cluster)%0A            EOT%0A          + record     = "cluster:node_cpu:ratio_rate5m"%0A        }%0A    }%0A%0A  # module.rule-groups.azurerm_monitor_alert_prometheus_rule_group.node_recording_rules_rule_group will be created%0A  + resource "azurerm_monitor_alert_prometheus_rule_group" "node_recording_rules_rule_group" {%0A      + cluster_name        = "prod-velidaaks"%0A      + description         = "Node Recording Rules Rule Group"%0A      + id                  = (known after apply)%0A      + interval            = "PT1M"%0A      + location            = "australiaeast"%0A      + name                = "NodeRecordingRulesRuleGroup-prod-velidaaks"%0A      + resource_group_name = "rg-velidaaks"%0A      + rule_group_enabled  = true%0A      + scopes              = (known after apply)%0A%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                count without (cpu, mode) (  node_cpu_seconds_total{job="node",mode="idle"})%0A            EOT%0A          + record     = "instance:node_num_cpu:sum"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - avg without (cpu) (  sum without (mode) (rate(node_cpu_seconds_total{job="node", mode=~"idle|iowait|steal"}[5m])))%0A            EOT%0A          + record     = "instance:node_cpu_utilisation:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                (  node_load1{job="node"}/  instance:node_num_cpu:sum{job="node"})%0A            EOT%0A          + record     = "instance:node_load1_per_cpu:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                1 - (  (    node_memory_MemAvailable_bytes{job="node"}    or    (      node_memory_Buffers_bytes{job="node"}      +      node_memory_Cached_bytes{job="node"}      +      node_memory_MemFree_bytes{job="node"}      +      node_memory_Slab_bytes{job="node"}    )  )/  node_memory_MemTotal_bytes{job="node"})%0A            EOT%0A          + record     = "instance:node_memory_utilisation:ratio"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_vmstat_pgmajfault{job="node"}[5m])%0A            EOT%0A          + record     = "instance:node_vmstat_pgmajfault:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                rate(node_disk_io_time_weighted_seconds_total{job="node", device!=""}[5m])%0A            EOT%0A          + record     = "instance_device:node_disk_io_time_weighted_seconds:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_bytes_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_bytes_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_receive_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_receive_drop_excluding_lo:rate5m"%0A        }%0A      + rule {%0A          + enabled    = true%0A          + expression = <<-EOT%0A                sum without (device) (  rate(node_network_transmit_drop_total{job="node", device!="lo"}[5m]))%0A            EOT%0A          + record     = "instance:node_network_transmit_drop_excluding_lo:rate5m"%0A        }%0A    }%0A%0A  # module.ssh-key.azapi_resource.ssh_public_key will be created%0A  + resource "azapi_resource" "ssh_public_key" {%0A      + body                      = jsonencode({})%0A      + id                        = (known after apply)%0A      + ignore_casing             = false%0A      + ignore_missing_property   = true%0A      + location                  = "australiaeast"%0A      + name                      = "sshinporpoise"%0A      + output                    = (known after apply)%0A      + parent_id                 = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks"%0A      + removing_special_chars    = false%0A      + schema_validation_enabled = true%0A      + type                      = "Microsoft.Compute/sshPublicKeys@2022-11-01"%0A    }%0A%0A  # module.ssh-key.azapi_resource_action.ssh_public_key_gen must be replaced%0A-/+ resource "azapi_resource_action" "ssh_public_key_gen" {%0A      ~ id                     = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise/generateKeyPair" -> (known after apply)%0A      ~ output                 = {%0A          - privateKey = <<-EOT%0A                -----BEGIN RSA PRIVATE KEY-----%0D%0A                MIIG5AIBAAKCAYEA6mHNM6N37QSWcrHD6EhINtP4lZkLTKG3UTVTLxDvwetEcLyY%0D%0A                M/4sRMn/u0nXDndNdjFDwB80M+xzt876GtyKvBjMbzcjTFaeiUpKGNwXssmc8GnA%0D%0A                xGi6yh49VY5CYYPa/3lXZlDw1wPzs+IMa4r9aQu875jxiXjAfN5qRidfBRsG+6Q+%0D%0A                ZVle6Q6PqMWPsNu21RIXmVgiTTzb2vAfPQMnK2QBztbJ0nTuLnpWQ7R1o5jyZPa9%0D%0A                rOLzbigS+lHtVB2Tsa9lcIROBq2zh+e+Ffjn2BJj9Iraoj0bdYkV/cz+joyRaTW8%0D%0A                HhZSKDz+0RrRXMWcJE//TbjaVDEI679mE5qSOWPhO7zSESnf7PoYb07/LH5ei9t8%0D%0A                TYg5//5Ps89NsFKYlBX9B287WahNYn72iGl5OlRAs7mx8Dfxy1XcJMhqiMqN07eG%0D%0A                n4iis0aFX/gYw85S4+L1wnnxnQm6ZNe3qp7xmH2ePQ9QsA4E7n0c40vXfVkqpB68%0D%0A                zYyYa+djFrwZMvhxAgMBAAECggGBANNzWoJsxsPxMJ3W3ExR8bxtLcYg5X3EI7NC%0D%0A                7YH3wKXtT7h5nMLDW0LQDkP0UO1/GkY4GcxZGmqBtsAsHZ1gPFWH9d+cGd9EAhEQ%0D%0A                EZst7L9ifpCyh7NqXKH9+A2YozCAmXGEEiJ/gVgp+5HcrKHVKdu8OD7cd4QziUze%0D%0A                B3i1Cld706fwvE4I+8Q8W8TCP2kqP18ozFuOlJuj/SEfIr+TeaH+vlbRlhClZ0BN%0D%0A                JEg+pSbr1DrcE7DGqyFFTCHDCd6qMpvDqdWXn3U4deGtSQwc4ZqxMmhjwGWGOVuw%0D%0A                sxtWjTUJg0GRaHORCu/VKTCS9IBz9ARLEHeTknuZfi0/WGfJT1K+fhPYgrVR3zbY%0D%0A                6yHbr1EK+B7HImbssyKP5UFRihCad/RIOwvB5mMl6CCzwGREeggXRBVktk9iiuHt%0D%0A                uuur8w+G10zJeF/2gHzJw2ERc5/E2AK16xVQ7nfGCz4UPa6Mn8tvXS11fvZCSrQb%0D%0A                No6ugyf52AHZC5zwEGnUYw+d7fbPBQKBwQD4b989+Yhon5iJyFjSf/ni89vBPeqR%0D%0A                lNACurbYTgjmXF1zRN9ZYJVV7N9U7oTwmBQ1KWaMOQZRXKVL+UI/5KSxuSx7IpbJ%0D%0A                +toZCQp1FC+IwxtJphEz1Y83b5JVdcX1CPpg3RKVh2mHIRGin3k/QVqLQGZT4Qy8%0D%0A                tzJk/7vvhow5NtLxsGpVucLG+D4gctrEWOUJJWRiNCvgix03S6X4i5psxG4hA2qI%0D%0A                B/Y1IY7C1SdFtyojvFHATjnGo8Xpi72qIdMCgcEA8YRlWbLq78xFLoZdLHs9EKG5%0D%0A                jsRfRU0F2N4//S68CaP5+tkWWcQLoQJOu6tIaVF2SOllWGJl8BlXo+yL/1Alg5+i%0D%0A                sPXtBZWlRjwrEOsxnIIVIl7XQ1rFj+o1Lp+FGTQCgoa9Bnl7geWzMpm6IwdrerG4%0D%0A                sbyh+rjxbtifYsOgE5D7OJ7h827qXqEFL0NFK+KGIjVp38tGPNhiRBg+ULFF7eJl%0D%0A                esRNx0XhCvdcSok86qy+icaMH3Xl4zu0MZr3y04rAoHAR0Bummuyv67mJL4dG2Iw%0D%0A                3PJrmGSVneM8NUwvnKHk04yyEJk0JYIZ0mb5NnaiEg7L3ONe0eCY+0TC86MtaP2+%0D%0A                bmpZY4dsD8muO3foU+PSLjsm3FyQmnkpdhC9u1znxXsptBYzekc38NV/JVDviUDJ%0D%0A                Ix75Oh1Vddpkzaq6z9ua493hagfat3NrdX1E9DF8pMuKBLGAtNmZq/C6FF3R4BLJ%0D%0A                22AK5dUA/Lqr1lklhKN1e/0oTM958tl8oIff/zdg0iaZAoHAVqhVoUC0UYRu0km9%0D%0A                xscVWxFcPiCxunDvhyf/t718FM10VZBtF5pjPctRKr9DhR6InZK5HWR5BRRiwNuQ%0D%0A                Q/Si8T5nJq2m9RkDq1bNcQ2iyHBYWvPCs1Uvi/rSSD9Oh4OE3wavblJKgYpEqQRF%0D%0A                qGnyI5z/Ey8Gw6p2Xnp1ff+JQVwE+ATyN+F1UKzf6lxtxlhKHp4htf3+3rgZUiuM%0D%0A                uHFTEQ7psIodCkJFhCTLRadGZ0HCQDcwcd1gtg7nEeFzxcvvAoHBAPJJOZdUdsSX%0D%0A                OSJJfb7IvHIbrKyB9B999F/vYC+38xOl3U7a/o7CI9yslDbFifz0R/Fgspdcc9rj%0D%0A                /t4bJeb+NS4hyioJ9uKhXBc7/QduDbDguXSPzFInRAbgDG4NjxDrUuzMNJ/75J6E%0D%0A                CFFSJSjHi36HnhhjXVuw5rU7gKYDW6mhqJSSyVfsNgUESG1mz1w7jdn5Ie+bdXGL%0D%0A                6lRzcwbwDGhvICYCrsDFyPAJ+Tr4W17lIh6x3TDTZvhAbTlsbIVizA==%0D%0A                -----END RSA PRIVATE KEY-----%0A            EOT%0A          - publicKey  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDqYc0zo3ftBJZyscPoSEg20/iVmQtMobdRNVMvEO/B60RwvJgz/ixEyf+7SdcOd012MUPAHzQz7HO3zvoa3Iq8GMxvNyNMVp6JSkoY3BeyyZzwacDEaLrKHj1VjkJhg9r/eVdmUPDXA/Oz4gxriv1pC7zvmPGJeMB83mpGJ18FGwb7pD5lWV7pDo+oxY+w27bVEheZWCJNPNva8B89AycrZAHO1snSdO4uelZDtHWjmPJk9r2s4vNuKBL6Ue1UHZOxr2VwhE4GrbOH574V+OfYEmP0itqiPRt1iRX9zP6OjJFpNbweFlIoPP7RGtFcxZwkT/9NuNpUMQjrv2YTmpI5Y+E7vNIRKd/s+hhvTv8sfl6L23xNiDn//k+zz02wUpiUFf0HbztZqE1ifvaIaXk6VECzubHwN/HLVdwkyGqIyo3Tt4afiKKzRoVf+BjDzlLj4vXCefGdCbpk17eqnvGYfZ49D1CwDgTufRzjS9d9WSqkHrzNjJhr52MWvBky+HE= generated-by-azure"%0A        } -> (known after apply)%0A      ~ resource_id            = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-velidaaks/providers/Microsoft.Compute/sshPublicKeys/sshinporpoise" -> (known after apply) # forces replacement%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "australiaeast"%0A      + name                = "prod-uai-velidaaks"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "rg-velidaaks"%0A      + tags                = {%0A          + "application" = "velidaaks"%0A          + "environment" = "prod"%0A          + "location"    = "australiaeast"%0A          + "owner"       = "willvelida"%0A          + "sub"         = "MVP-sub"%0A          + "type"        = "POC"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0APlan: 16 to add, 1 to change, 3 to destroy.%0A%0AChanges to Outputs:%0A  ~ kube_config         = (sensitive value)%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>